In [48]:
# Import Librarys

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [49]:
# Import datasets Titles movies

titles_movies = pd.read_csv("./scored_api/datasets/movies_completo_api.csv")

In [50]:
titles_movies.shape

(22998, 17)

In [51]:
# Import datasets

df1 = pd.read_csv('../ratings_datasets/1.csv')
df2 = pd.read_csv('../ratings_datasets/2.csv')
df3 = pd.read_csv('../ratings_datasets/3.csv')
df4 = pd.read_csv('../ratings_datasets/4.csv')
df5 = pd.read_csv('../ratings_datasets/5.csv')
df6 = pd.read_csv('../ratings_datasets/6.csv')
df7 = pd.read_csv('../ratings_datasets/7.csv')
df8 = pd.read_csv('../ratings_datasets/8.csv')

In [52]:
# Join Datasets users

users_id = pd.concat([df1, df2, df3, df4, df5, df6, df7, df8], ignore_index=True)
users_id.head(2)

   userId  rating   timestamp movieId
0       1     1.0  1425941529   as680
1       1     4.5  1425942435  ns2186

In [53]:
users_id['movieId'].shape

(11024289,)

In [54]:
# Rename columns rating to score
users_id = users_id.rename(columns={"rating": "score"})

In [55]:
# Rename columns movieId to Id
users_id = users_id.rename(columns={"movieId": 'id'})

In [56]:
users_id.shape

(11024289, 4)

In [57]:
users_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11024289 entries, 0 to 11024288
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   score      float64
 2   timestamp  int64
 3   id         object
dtypes: float64(1), int64(2), object(1)
memory usage: 336.4+ MB

In [58]:
titles_movies.head(2)

,Unnamed: 0,show_id,type,title,director,cast,country,date_added,release_year,rating,listed_in,description,duration_int,duration_type,id,score_medio,platform
0,0,s1,movie,the grand seduction,don mckellar,"brendan gleeson, taylor kitsch, gordon pinsent",canada,2021-03-30,2014,G,"comedy, drama",a small fishing village must procure a local d...,113,min,as1,3.47,amazon
1,1,s2,movie,take care good night,girish joshi,"mahesh manjrekar, abhay mahajan, sachin khedekar",india,2021-03-30,2018,13+,"drama, international",a metro family decides to fight a cyber crimin...,110,min,ns2,3.55,netflix

In [66]:
movies_title = titles_movies[['id','title']]

In [67]:
movies_title.head(2)

    id                 title
0  as1   the grand seduction
1  ns2  take care good night

In [68]:
users_id.head(2)

   userId  score   timestamp      id
0       1    1.0  1425941529   as680
1       1    4.5  1425942435  ns2186

In [71]:
movies_rating = users_id[['id','userId','score']]

In [72]:
movies_rating.head(2)

       id  userId  score
0   as680       1    1.0
1  ns2186       1    4.5

In [73]:
# Merge 
movies = pd.merge(movies_rating, movies_title, on='id')

In [74]:
movies.shape

(9564574, 4)

In [75]:
movies.head(2)

       id  userId  score        title
0  ns2186       1    4.5  horse tribe
1  ns2186     231    4.0  horse tribe

In [32]:
movies.to_parquet('movies_completo_ML.parquet')